In [1]:
import pandas as pd
from pandas import Series, DataFrame

# Series #

In [2]:
datos = Series(['Juan', 'Pedro', 'Luis'])
datos

0     Juan
1    Pedro
2     Luis
dtype: object

In [3]:
datos1 = Series(['Juan', 'Pedro', 'Luis'], index = ['a', 'b', 'c'])
datos1

a     Juan
b    Pedro
c     Luis
dtype: object

In [4]:
datos1.values

array(['Juan', 'Pedro', 'Luis'], dtype=object)

In [5]:
datos1['a']

'Juan'

In [6]:
datos[0]

'Juan'

In [7]:
datos1['d'] = 'Ana'
datos1

a     Juan
b    Pedro
c     Luis
d      Ana
dtype: object

In [8]:
sData = {'Pedro' : 23,
         'Juan' : 31,
         'María' : 18}
sData

{'Pedro': 23, 'Juan': 31, 'María': 18}

In [9]:
data = Series(sData)
data

Pedro    23
Juan     31
María    18
dtype: int64

In [10]:
data.index

Index(['Pedro', 'Juan', 'María'], dtype='object')

In [11]:
data.values

array([23, 31, 18])

# Data Frame #

In [30]:
dicc = {'Departamento' : ['Atlántico', 'Bolívar', 'Sucre'],
        'Año' : [2000, 2010, 2005],
        'Población' : [1.5, 3.0, 1.0]}
dicc

{'Departamento': ['Atlántico', 'Bolívar', 'Sucre'],
 'Año': [2000, 2010, 2005],
 'Población': [1.5, 3.0, 1.0]}

In [31]:
df = DataFrame(dicc)
df

  Departamento   Año  Población
0    Atlántico  2000        1.5
1      Bolívar  2010        3.0
2        Sucre  2005        1.0

In [14]:
df['area'] = [1200, 1100, 1000]
df

  Departamento   Año  Población  area
0    Atlántico  2000        1.5  1200
1      Bolívar  2010        3.0  1100
2        Sucre  2005        1.0  1000

In [15]:
del df['area']
df

  Departamento   Año  Población
0    Atlántico  2000        1.5
1      Bolívar  2010        3.0
2        Sucre  2005        1.0

# Leer dataser csv #

In [16]:
data = pd.read_csv('DataSets/titanic/titanic3.csv')

In [17]:
data.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [18]:
data.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [19]:
data.iloc[10]

pclass                            1
survived                          0
name         Astor, Col. John Jacob
sex                            male
age                            47.0
sibsp                             1
parch                             0
ticket                     PC 17757
fare                        227.525
cabin                       C62 C64
embarked                          C
boat                            NaN
body                          124.0
home.dest              New York, NY
Name: 10, dtype: object

In [20]:
data.iloc[10:15]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
10,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.525,C62 C64,C,NaN,124.0,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,PC 17757,227.525,C62 C64,C,4,NaN,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.0,0,0,PC 17477,69.300,B35,C,9,NaN,"Paris, France"
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,19877,78.850,NaN,S,6,NaN,NaN
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.000,A23,S,B,NaN,"Hessle, Yorks"

In [21]:
data.shape

(1309, 14)

In [26]:
data1 = pd.read_excel('DataSets/titanic/titanic3.xls', 'titanic3')
data1.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [33]:
df.to_csv('DataSets/df.csv')

# Análisis preliminar #

In [34]:
data.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000